{
    "name": "Maurizio Tolomeo",
    "job": "Web Developer \"Frontend\"",
    "description": {
        "it": "Sono ♂️ Maurizio Tolomeo 😉, alias MORIS. Sono uno sviluppatore web e lavoro presso CRMPartners S.R.L., con una specializzazione in tecnologie Frontend. Nel mio ruolo, mi occupo di progettare e sviluppare interfacce utente avanzate e intuitive che migliorano l'esperienza dell'utente finale. Supporto le aziende nella creazione di applicazioni web complesse attraverso l'integrazione di sistemi CRM avanzati e l'utilizzo di tecnologie all'avanguardia come React. Analizzo le esigenze specifiche di ogni cliente per progettare soluzioni personalizzate che ottimizzano i processi aziendali e migliorano l'efficienza operativa. La mia competenza nella gestione di stati complessi e nella costruzione di componenti riutilizzabili mi permette di sviluppare applicazioni che non solo rispondono alle necessità attuali, ma che sono anche facilmente scalabili per future espansioni. Mi considero una persona affidabile, socievole e dinamica, sempre orientata al raggiungimento degli obiettivi prefissati. Sono desideroso di apprendere nuove competenze e affrontare sfide stimolanti, poiché il lavoro abitudinario tende ad annoiarmi nel lungo periodo. La mia passione per l'informatica è nata fin da bambino, e oggi scrivere codice rappresenta non solo il mio lavoro, ma anche una vera e propria passione.",
        "en": "I'm ♂️ Maurizio Tolomeo 😉, aka MORIS. I'm a web developer and I work at CRMPartners S.R.L., specializing in Frontend technologies. In my role, I design and develop advanced and intuitive user interfaces that enhance the end user experience. I support companies in creating complex web applications through the integration of advanced CRM systems and the use of cutting-edge technologies such as React. I analyze the specific needs of each customer to design customized solutions that optimize business processes and improve operational efficiency. My expertise in managing complex states and building reusable components allows me to develop applications that not only meet current needs, but are also easily scalable for future expansions. I consider myself a reliable, sociable and dynamic person, always focused on achieving the set goals. I am eager to learn new skills and face challenging tasks, as routine work tends to bore me in the long run. My passion for computer science was born when I was a child, and today writing code represents not only my job, but also a real passion."
    }
}