{
	"name": "Maurizio Tolomeo",
	"job": "Web Developer \"Frontend\"",
	"whoAmIDescription": {
		"it": "<p>🚀 Maurizio Tolomeo | Frontend Developer | alias MORIS</p><br><p>Sono uno sviluppatore web con una forte specializzazione nel Frontend, appassionato di tecnologie moderne che permettono di costruire interfacce utente eleganti, funzionali e facili da usare. Credo che il design delle esperienze digitali debba essere fluido e accessibile a tutti, e per questo mi impegno a tradurre idee astratte in prodotti concreti e performanti.</p><br><p>Sono una persona curiosa e motivata, sempre alla ricerca di nuove sfide e di aggiornamenti professionali per rimanere all’avanguardia in un settore in continua evoluzione. Per me programmare è molto più di un lavoro: è una vera passione e un modo per esprimere creatività e precisione tecnica.</p>",
		"en": "<p>🚀 Maurizio Tolomeo | Frontend Developer | aka MORIS</p><br><p>I am a web developer specialized in Frontend technologies, passionate about creating sleek, functional, and user-friendly interfaces. I believe digital experiences should be smooth and accessible to everyone, and I strive to transform abstract ideas into tangible, high-performance products.</p><br><p>Curious and driven, I constantly seek new challenges and professional growth to stay at the forefront of this ever-evolving field. For me, coding is much more than a job — it’s a true passion and a way to express creativity and technical precision.</p>"
	},
	"whatIDoDescription": {
		"it": "<p>Nel mio lavoro mi occupo di progettare e sviluppare soluzioni software su misura, mettendo particolare attenzione all’integrazione di sistemi complessi e all’ottimizzazione dei processi aziendali. Utilizzo principalmente React e tecnologie correlate per gestire stati applicativi complessi, creare componenti modulari e riutilizzabili, e garantire così un codice pulito, efficiente e facilmente mantenibile nel tempo.</p><br><p>Il mio obiettivo è fornire prodotti scalabili e performanti che rispondano alle esigenze reali delle aziende, migliorando la produttività e l’esperienza utente.</p>",
		"en": "<p>In my work, I design and develop tailored software solutions, focusing on integrating complex systems and optimizing business processes. I primarily use React and related technologies to handle complex application states, build modular and reusable components, and ensure clean, efficient, and maintainable code over time.</p><br><p>My goal is to deliver scalable and high-performing products that meet real business needs, enhancing productivity and user experience.</p>"
	},
	"secondary_skills": {
		"it": "<p>Sviluppatore specializzato nell'ecosistema JavaScript/TypeScript. La mia expertise principale è in React (Web e Native), ma possiedo gli strumenti per curare l'intero stack tecnologico, dal database all'interfaccia utente.</p><br><ul><li><b>Frontend Core:</b> React (Avanzato), Next.js, TypeScript, Tailwind CSS, SCSS.</li><li><b>Backend Core:</b> Node.js, Express.js, Supabase.</li><li><b>Database:</b> PostgreSQL, MySQL, MongoDB.</li><li><b>Version Control:</b> Git, GitHub, GitLab.</li><li><b>Design Tools:</b> Figma</li></ul></p>",
		"en": "<p>Specialized developer in the JavaScript/TypeScript ecosystem. My main expertise is in React (Web and Native), but I have the tools to care for the entire technology stack, from the database to the user interface.<br><ul><li><b>Frontend Core:</b> React (Avanzato), Next.js, TypeScript, Tailwind CSS, SCSS.</li><li><b>Backend Core:</b> Node.js, Express.js, Supabase.</li><li><b>Database:</b> PostgreSQL, MySQL, MongoDB.</li><li><b>Version Control:</b> Git, GitHub, GitLab.</li><li><b>Design Tools:</b> Figma</li></ul></p>"
	},
	"primary_skills": [
		{
			"link": {
				"url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/javascript-colored.svg",
				"alt": "JavaScript"
			}
		},
		{
			"link": {
				"url": "https://www.typescriptlang.org/"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/typescript-colored.svg",
				"alt": "Typescript"
			}
		},
		{
			"link": {
				"url": "https://nextjs.org/docs"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/nextjs-colored.svg",
				"alt": "NextJs"
			}
		},
		{
			"link": {
				"url": "https://reactjs.org/"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/react-colored.svg",
				"alt": "React"
			}
		},
		{
			"link": {
				"url": "https://developer.mozilla.org/en-US/docs/Glossary/HTML5"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/html5-colored.svg",
				"alt": "HTML5"
			}
		},
		{
			"link": {
				"url": "https://www.w3.org/TR/CSS/#css"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/css3-colored.svg",
				"alt": "CSS3"
			}
		},
		{
			"link": {
				"url": "https://tailwindcss.com/"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/tailwindcss-colored.svg",
				"alt": "TailwindCSS"
			}
		},
		{
			"link": {
				"url": "https://nodejs.org/en/"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/nodejs-colored.svg",
				"alt": "NodeJs"
			}
		},
		{
			"link": {
				"url": "https://expressjs.com/"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/express-colored.svg",
				"alt": "ExpressJs"
			}
		},
		{
			"link": {
				"url": "https://supabase.io/"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/supabase-colored.svg",
				"alt": "Supabase"
			}
		},
		{
			"link": {
				"url": "https://www.figma.com/"
			},
			"img": {
				"src": "https://raw.githubusercontent.com/danielcranney/readme-generator/main/public/icons/skills/figma-colored.svg",
				"alt": "Figma"
			}
		}
	],
	"services": [
		{
			"title": {
				"it": "Prompt Engineer",
				"en": "Prompt Engineer"
			},
			"description": {
				"it": "Ottimizzo l'interazione con modelli linguistici avanzati (LLM) per generare contenuti di alta qualità, automatizzare workflow complessi e sviluppare soluzioni basate sull'intelligenza artificiale generativa con precisione chirurgica.",
				"en": "I optimize interactions with Advanced Language Models (LLMs) to generate high-quality content, automate complex workflows, and develop generative AI-based solutions with surgical precision."
			},
			"icon": "FaRobot"
		},
		{
			"title": {
				"it": "Frontend Developer",
				"en": "Frontend Developer"
			},
			"description": {
				"it": "Sviluppo interfacce web moderne, scalabili e ad alte prestazioni utilizzando React e Next.js. Mi concentro sulla scrittura di codice pulito, sull'accessibilità e sull'ottimizzazione dei Core Web Vitals per un'esperienza utente eccellente.",
				"en": "I develop modern, scalable, and high-performance web interfaces using React and Next.js. I focus on writing clean code, ensuring accessibility, and optimizing Core Web Vitals for an excellent user experience."
			},
			"icon": "FaCode"
		},
		{
			"title": {
				"it": "UI/UX Designer",
				"en": "UI/UX Designer"
			},
			"description": {
				"it": "Progetto esperienze digitali intuitive e visivamente accattivanti. Trasformo requisiti complessi in wireframe e prototipi interattivi, ponendo l'utente al centro del processo creativo per massimizzare l'engagement e l'usabilità.",
				"en": "I design intuitive and visually appealing digital experiences. I transform complex requirements into wireframes and interactive prototypes, placing the user at the center of the creative process to maximize engagement and usability."
			},
			"icon": "FaPaintBrush"
		}
	]
}
