{
	"projects": {
		"it": [
			{
				"id": 1,
				"title": "Todo App",
				"description": "ToDo Manager è un'applicazione web realizzata con React, TypeScript, Vite.js e Tailwind CSS, progettata per semplificare la gestione delle attività quotidiane. Funzionalità principali: 1. Gestione avanzata delle attività – Crea, modifica e aggiorna i tuoi To-Do con descrizioni dettagliate. 2. Categorie personalizzate – Organizza i task in tre stati: To-Do, In Progress e Done. 3. Priorità dei task – Imposta livelli di priorità per concentrarti su ciò che è più importante. 4. Notifiche di scadenza – Ricevi avvisi per non perdere di vista le attività imminenti. 5. Modifica la descrizione dei task senza perdere traccia dei progressi. Grazie alla combinazione di React e Vite.js, l'app garantisce prestazioni elevate e un'esperienza utente fluida, mentre Tailwind CSS assicura un'interfaccia moderna e reattiva. Perfetta per chi vuole restare organizzato con un’interfaccia intuitiva e potente!",
				"image": {
					"src": "/projects/1.webp",
					"alt": "Todo App"
				},
				"public": true,
				"url": "https://todolist.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/project-todolist",
				"tags": ["React", "Typescript", "HeroUI", "TailwindCSS", "Vitejs"]
			},
			{
				"id": 2,
				"title": "Conteggio Consumo Acqua Condominio",
				"description": "Questa applicazione è stata sviluppata per semplificare la gestione del consumo di acqua in un condominio. Consente di registrare e monitorare i consumi di acqua per ogni appartamento, facilitando la suddivisione delle spese tra i condomini. L'applicazione è realizzata con React, TypeScript, Vite.js e Tailwind CSS, garantendo un'interfaccia utente moderna e reattiva.",
				"image": {
					"src": "/projects/2.webp",
					"alt": "Conteggio Consumo Acqua Condominio App"
				},
				"public": true,
				"url": "https://counting-condominium-water.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/conteggio-consumo-acqua-condominio",
				"tags": ["React", "Typescript", "TailwindCSS", "Vitejs"]
			},
			{
				"id": 3,
				"title": "Git Commit Helper IT",
				"description": "Git Commit Helper IT è un'applicazione CLI (Command Line Interface) sviluppata in JavaScript che sfrutta l'intelligenza artificiale per assistere gli sviluppatori nella scrittura di messaggi di commit chiari e significativi. Utilizzando modelli di linguaggio avanzati, l'applicazione analizza le modifiche apportate al codice e suggerisce messaggi di commit appropriati, migliorando la comunicazione all'interno del team di sviluppo e facilitando la gestione del versionamento del codice.",
				"image": {
					"src": "/projects/3.webp",
					"alt": "Git Commit Helper IT CLI"
				},
				"public": true,
				"url": "https://www.npmjs.com/package/git-commit-helper-it",
				"github": "https://github.com/moris88/git-commit-helper",
				"tags": ["Javascript", "AI", "Git", "CLI"]
			},
			{
				"id": 4,
				"title": "PDF Merged IT",
				"description": "PDF Merged IT è un'applicazione web sviluppata in JavaScript che consente agli utenti di unire più file PDF in un unico documento. L'applicazione offre un'interfaccia intuitiva e facile da usare, permettendo agli utenti di caricare i loro file PDF, organizzarli nell'ordine desiderato e scaricare il file PDF risultante. Utilizzando librerie JavaScript avanzate per la manipolazione dei PDF, l'app garantisce un processo di fusione rapido ed efficiente, ideale per chiunque abbia bisogno di combinare documenti PDF per lavoro, studio o uso personale.",
				"image": {
					"src": "/projects/4.webp",
					"alt": "PDF Merged IT App"
				},
				"public": true,
				"url": "https://pdf-merged.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/pdf-merged",
				"tags": ["React", "Typescript", "TailwindCSS", "Vitejs", "pdf-lib"]
			},
			{
				"id": 5,
				"title": "Generatore di Fattura IT",
				"description": "Generatore di Fattura IT è un'applicazione web sviluppata in JavaScript che consente agli utenti di creare e personalizzare fatture professionali in modo semplice e veloce. L'applicazione offre un'interfaccia intuitiva che permette di inserire i dettagli del cliente, gli articoli o servizi forniti, le quantità, i prezzi e le tasse applicabili. Una volta completata la fattura, gli utenti possono scaricarla in formato PDF. Utilizzando librerie JavaScript avanzate per la generazione di PDF, l'app garantisce un processo efficiente e professionale.",
				"image": {
					"src": "/projects/5.webp",
					"alt": "Invoice Generator IT App"
				},
				"public": true,
				"url": "https://invoice-generator.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/generatore-di-fattura",
				"tags": [
					"React",
					"Typescript",
					"TailwindCSS",
					"Vitejs",
					"pdf-lib",
					"react-signature-canvas",
					"jspdf",
					"html2canvas"
				]
			},
			{
				"id": 6,
				"title": "Creditsafe Business Report for Zoho CRM",
				"description": "Creditsafe Business Report for Zoho CRM è un'applicazione web sviluppata in Typescript e Nextjs che consente agli utenti di creare e personalizzare report aziendali professionali in modo semplice e veloce. L'applicazione offre un'interfaccia intuitiva che permette di ricercare e analizzare i dati aziendali in modo efficiente. Una volta completato il report, gli utenti possono scaricarlo in formato PDF.",
				"image": {
					"src": "/projects/6.webp",
					"alt": "Creditsafe for Zoho CRM App"
				},
				"public": false,
				"url": "http://marketplace.zoho.com/app/crm/creditsafe-for-zoho-crm#overview",
				"tags": ["Nextjs", "Typescript", "TailwindCSS", "React", "creditsafe"]
			},
			{
				"id": 7,
				"title": "Portale ex-alumni dell'università di Trento",
				"description": "Il portale web degli ex-alumni dell'università di Trento è una piattaforma online sviluppata in PHP e Drupal che consente agli ex studenti dell'università di connettersi, condividere esperienze e accedere a risorse esclusive. La parte di frontend è stata realizzata con HTML, CSS e JavaScript, mentre il backend è stato sviluppato con PHP e Drupal, garantendo un'esperienza utente fluida e un'efficace gestione dei contenuti. Il sito offre funzionalità di visualizzare news ed eventi, l'accesso a eventi e opportunità di networking.",
				"image": {
					"src": "/projects/7.webp",
					"alt": "Alumni Website University of Trento"
				},
				"public": false,
				"url": "https://alumni.unitn.it/",
				"tags": ["PHP", "Drupal", "HTML", "CSS", "JavaScript"]
			},
			{
				"id": 8,
				"title": "CLI Backup Script",
				"description": "CLI Backup Script è un'applicazione Command Line Interface (CLI) sviluppata in JavaScript che consente agli utenti di eseguire backup dei propri file in modo semplice e veloce. L'applicazione offre un'interfaccia intuitiva che permette di selezionare i file da includere nel backup e avviare il processo con un solo comando. Utilizzando librerie JavaScript avanzate per la gestione del file system, l'app garantisce un processo di backup efficiente e affidabile, ideale per chiunque abbia bisogno di proteggere i propri dati in modo rapido e senza complicazioni.",
				"image": {
					"src": "/projects/8.webp",
					"alt": "CLI Backup Script"
				},
				"public": true,
				"url": "https://www.npmjs.com/package/backup-script-cli",
				"github": "https://github.com/moris88/backup-cli",
				"tags": ["Javascript", "Node.js", "CLI", "File System"]
			},
			{
				"id": 9,
				"title": "React-PDF-Editor",
				"description": "React-PDF-Editor è un'applicazione web sviluppata in JavaScript che consente agli utenti di creare file PDF in modo semplice e veloce, con l'uso di placeholder. L'applicazione offre un'interfaccia intuitiva che permette di inserire i dati nei placeholder e generare un file PDF personalizzato. Utilizzando librerie JavaScript avanzate per la manipolazione dei PDF, l'app garantisce un processo di creazione efficiente e professionale, ideale per chiunque abbia bisogno di generare documenti PDF in modo rapido e senza complicazioni. E' una applicazione in modalità alpha, quindi è in fase di sviluppo e potrebbe essere soggetta a modifiche e miglioramenti futuri.",
				"image": {
					"src": "/projects/9.webp",
					"alt": "React-PDF-Editor"
				},
				"public": true,
				"url": "https://react-pdf-editor.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/React-PDF-Editor",
				"tags": ["React", "Typescript", "TailwindCSS", "Vitejs", "pdf-lib"]
			}
		],
		"en": [
			{
				"id": 1,
				"title": "Todo App",
				"description": "ToDo Manager is a web application built with React, TypeScript, Vite.js, and Tailwind CSS, designed to simplify daily task management. Key Features: 1. Advanced task management – Create, edit, and update your to-dos with detailed descriptions. 2. Custom categories – Organize tasks into three states: To-Do, In Progress, and Done. 3. Task prioritization – Set priority levels to focus on what matters most. 4. Deadline notifications – Receive alerts to keep track of upcoming tasks. 5. Edit task descriptions without losing progress. By leveraging React and Vite.js, the app ensures high performance and a smooth user experience, while Tailwind CSS provides a modern and responsive interface. Perfect for those who want to stay organized with an intuitive and powerful interface!",
				"image": {
					"src": "/projects/1.webp",
					"alt": "Todo App"
				},
				"public": true,
				"url": "https://todolist.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/project-todolist",
				"tags": ["React", "Typescript", "HeroUI", "TailwindCSS", "Vitejs"]
			},
			{
				"id": 2,
				"title": "Water Consumption Tracking App",
				"description": "This application was developed to simplify the management of water consumption in a condominium. It allows users to record and monitor water usage for each apartment, facilitating the division of expenses among residents. The app is built with React, TypeScript, Vite.js, and Tailwind CSS, ensuring a modern and responsive user interface.",
				"image": {
					"src": "/projects/2.webp",
					"alt": "Water Consumption Tracking App"
				},
				"public": true,
				"url": "https://counting-condominium-water.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/conteggio-consumo-acqua-condominio",
				"tags": ["React", "Typescript", "TailwindCSS", "Vitejs"]
			},
			{
				"id": 3,
				"title": "Git Commit Helper IT",
				"description": "Git Commit Helper IT is a Command Line Interface (CLI) application developed in JavaScript that leverages artificial intelligence to assist developers in writing clear and meaningful commit messages. By utilizing advanced language models, the application analyzes code changes and suggests appropriate commit messages, enhancing communication within the development team and facilitating code version management.",
				"image": {
					"src": "/projects/3.webp",
					"alt": "Git Commit Helper IT CLI"
				},
				"public": true,
				"url": "https://www.npmjs.com/package/git-commit-helper-it",
				"github": "https://github.com/moris88/git-commit-helper",
				"tags": ["Javascript", "AI", "Git", "CLI"]
			},
			{
				"id": 4,
				"title": "PDF Merged IT",
				"description": "PDF Merged IT is a web application developed in JavaScript that allows users to merge multiple PDF files into a single document. The application offers an intuitive and user-friendly interface, enabling users to upload their PDF files, arrange them in the desired order, and download the resulting merged PDF file. By utilizing advanced JavaScript libraries for PDF manipulation, the app ensures a fast and efficient merging process, ideal for anyone needing to combine PDF documents for work, study, or personal use.",
				"image": {
					"src": "/projects/4.webp",
					"alt": "PDF Merged IT App"
				},
				"url": "https://pdf-merged.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/pdf-merged",
				"tags": ["React", "Typescript", "TailwindCSS", "Vitejs", "pdf-lib"]
			},
			{
				"id": 5,
				"title": "Invoice Generator IT",
				"description": "Invoice Generator IT is a web application developed in JavaScript that allows users to create and customize professional invoices quickly and easily. The application provides an intuitive interface for entering client details, items or services provided, quantities, prices, and applicable taxes. Once the invoice is completed, users can download it in PDF format. By utilizing advanced JavaScript libraries for PDF generation, the app ensures an efficient and professional process.",
				"image": {
					"src": "/projects/5.webp",
					"alt": "Invoice Generator IT App"
				},
				"public": true,
				"url": "https://invoice-generator.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/generatore-di-fattura",
				"tags": [
					"React",
					"Typescript",
					"TailwindCSS",
					"Vitejs",
					"pdf-lib",
					"react-signature-canvas",
					"jspdf",
					"html2canvas"
				]
			},
			{
				"id": 6,
				"title": "Creditsafe Business Report per Zoho CRM",
				"description": "Creditsafe Business Report per Zoho CRM is a web application developed in TypeScript and Next.js that allows users to create and customize professional business reports quickly and easily. The application provides an intuitive interface for searching and analyzing business data efficiently. Once the report is completed, users can download it in PDF format.",
				"image": {
					"src": "/projects/6.webp",
					"alt": "Creditsafe per Zoho CRM App"
				},
				"public": false,
				"url": "http://marketplace.zoho.com/app/crm/creditsafe-for-zoho-crm#overview",
				"tags": ["Nextjs", "Typescript", "TailwindCSS", "React", "creditsafe"]
			},
			{
				"id": 7,
				"title": "Alumni Portal of the University of Trento",
				"description": "The alumni portal of the University of Trento is an online platform developed in PHP and Drupal that allows former students to connect, share experiences, and access exclusive resources. The frontend is built with HTML, CSS, and JavaScript, while the backend is developed with PHP and Drupal, ensuring a smooth user experience and effective content management. The site offers features such as viewing news and events, and accessing networking opportunities.",
				"image": {
					"src": "/projects/7.webp",
					"alt": "Alumni Website University of Trento"
				},
				"public": false,
				"url": "https://alumni.unitn.it/",
				"tags": ["PHP", "Drupal", "HTML", "CSS", "JavaScript"]
			},
			{
				"id": 8,
				"title": "CLI Backup Script",
				"description": "CLI Backup Script is a Command Line Interface (CLI) application developed in JavaScript that allows users to perform backups of their files quickly and easily. The application provides an intuitive interface for selecting files to include in the backup and starting the process with a single command. By utilizing advanced JavaScript libraries for file system management, the app ensures an efficient and reliable backup process, ideal for anyone needing to protect their data quickly and without complications.",
				"image": {
					"src": "/projects/8.webp",
					"alt": "CLI Backup Script"
				},
				"public": true,
				"url": "https://www.npmjs.com/package/backup-script-cli",
				"github": "https://github.com/moris88/backup-cli",
				"tags": ["Javascript", "Node.js", "CLI", "File System"]
			},
			{
				"id": 9,
				"title": "React-PDF-Editor",
				"description": "React-PDF-Editor is a JavaScript-based web application designed to enable users to create PDF files quickly and easily through the use of placeholders. The application offers an intuitive interface that allows for simple data input into designated placeholders to generate customized PDF documents. By leveraging advanced JavaScript libraries for PDF manipulation, the app ensures an efficient and professional creation process, making it an ideal solution for anyone needing to generate PDF documents rapidly and without complications. Currently in its alpha stage, the application is under active development and may be subject to future changes and improvements.",
				"image": {
					"src": "/projects/9.webp",
					"alt": "React-PDF-Editor"
				},
				"public": true,
				"url": "https://react-pdf-editor.mauriziotolomeo.it/",
				"github": "https://github.com/moris88/React-PDF-Editor",
				"tags": ["React", "Typescript", "TailwindCSS", "Vitejs", "pdf-lib"]
			}
		]
	}
}
